# A simplified mapping of Mongolian phonemes to IPA
mongolian_to_ipa = {
    'а': 'a',  # æ OK
    'б': 'p',  # OK
    'в': 'w',  # OK
    'г': 'k',
    'д': 'd',
    'е': 'e',
    'ё': 'jo',
    'ж': 'ʒ',
    'з': 'z',
    'и': 'i',  # OK
    'й': 'j',
    'к': 'k',
    'л': 'ɮ',
    'м': 'm',
    'н': 'n',
    'о': 'ɔ',  # œ
    'ө': 'ө',
    'п': 'p',
    'р': 'r',
    'с': 's',
    'т': 't',
    'у': 'o',  # ʏ
    'ү': 'u',
    'ф': 'f',
    'х': 'x',
    'ц': 'ts',
    'ч': 'tʃ',
    'ш': 'ʃ',
    'щ': 'ʃː',
    'ъ': 'ʔ',
    'ы': 'ɯ',
    'ь': 'ʲ',
    'э': 'e',  # OK
    'ю': 'ju',
    'я': 'ja',
    'ий': 'iː',  # Анхаар
    'ээ': 'eː',
    'эй': 'eː',
    'оо': 'ɔː',  # œː
    'ой': 'œː',
    'уу': 'oː',  # ʏː
    'уй': 'oi',
    'өө': 'өː',  #
    'үү': 'uː',
    'үй': 'ui',
}